#+TITLE: Flare-on 6 Solution Notes

All the challenges come in a .7z file with password "flare"
* Flarebear
Flag:
#+begin_src text
th4t_was_be4rly_a_chall3nge@flare-on.com
#+end_src

Used [[https://github.com/budtmo/docker-android][this]] emulator

It's an apk, so might need to get  an emulator going?

Used dex2jar. See the FlareBearActivity has a getPassword function
that gives decryption key?

The isEcstatic function checks for mass of 72, happy of 30, clean of
false (0)


- clean increments mass by 0, happy by -1, clean by 6
- feed increments mass by 10, happy by 2, clean by -1
- play increments mass by -2, happy by 4, clean by -1

Linear system:

#+begin_src python :results output
import numpy as np
from numpy.linalg import inv

# First column corresponds to "clean",
# second to "feed", third to "play"
A = np.array([
    [0, 10, -2], # delta mass
    [-1, 2, 4],  # delta happy
    [6, -1, -1]])# delta clean

# target: 72 mass, 30 happy, 0 clean
b = np.array([
    [72],
    [30],
    [0]
    ])

print(inv(A) @ b)
#+end_src

#+RESULTS:
: [[2.]
:  [8.]
:  [4.]]

*need 2 cleans, 8 feeds, 4 plays*
